In [1]:
import numpy as np
import pandas as pd
import re

In [2]:
# read employees_astyle.csv data (converted data type)
emp_df = pd.read_csv('data/employees_astyle.csv')
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60

In [ ]:
# Find starting substring: use df[“Column_name”].str.startswith(“substring”)

In [3]:
emp_df['JOB_ID'].str.startswith('AC')

0      False
1      False
2      False
3      False
4      False
       ...
102    False
103    False
104    False
105     True
106     True
Name: JOB_ID, Length: 107, dtype: bool

In [4]:
# Find employees whose JOB_ID starts with “AC” (Accounting Department)
emp_df[emp_df['JOB_ID'].str.startswith('AC')]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07 00:00:00,AC_MGR,12008,0.0,101,110
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07 00:00:00,AC_ACCOUNT,8300,0.0,205,110

In [5]:
emp_df.loc[emp_df['JOB_ID'].str.startswith('AC'),['FIRST_NAME','LAST_NAME']]

    FIRST_NAME LAST_NAME
105    Shelley   Higgins
106    William     Gietz

In [6]:
emp_df['JOB_ID'].str.contains('REP')

0      False
1      False
2      False
3      False
4      False
       ...
102     True
103     True
104     True
105    False
106    False
Name: JOB_ID, Length: 107, dtype: bool

In [7]:
# Find employees whose JOB_ID contains “REP” (Representative)
emp_df[emp_df['JOB_ID'].str.contains('REP')]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
50,150,Peter,Tucker,PTUCKER,011.44.1344.129268,2005-01-30 00:00:00,SA_REP,10000,0.30,145,80
51,151,David,Bernstein,DBERNSTE,011.44.1344.345268,2005-03-24 00:00:00,SA_REP,9500,0.25,145,80
52,152,Peter,Hall,PHALL,011.44.1344.478968,2005-08-20 00:00:00,SA_REP,9000,0.25,145,80
53,153,Christopher,Olsen,COLSEN,011.44.1344.498718,2006-03-30 00:00:00,SA_REP,8000,0.20,145,80
54,154,Nanette,Cambrault,NCAMBRAU,011.44.1344.987668,2006-12-09 00:00:00,SA_REP,7500,0.20,145,80
55,155,Oliver,Tuvault,OTUVAULT,011.44.1344.486508,2007-11-23 00:00:00,SA_REP,7000,0.15,145,80
56,156,Janette,King,JKING,011.44.1345.429268,2004-01-30 00:00:00,SA_REP,10000,0.35,146,80
57,157,Patrick,Sully,PSULLY,011.44.1345.929268,2004-03-04 00:00:00,SA_REP,9500,0.35,146,80
58,158,Allan,McEwen,AMCEWEN,011.44.1345.829268,2004-08-01 00:00:00,SA_REP,9000,0.35,146,80
59,159,Lindsey,Smith,LSMITH,011.44.1345.729268,2005-03-10 00:00:00,SA_REP,8000,0.30,146,80
60,160,Louise,Doran,LDORAN,011.44.1345.629268,2005-12-15 00:00:00,SA_REP,7500,0.30,146,80
61,161,Sarath,Sewall,SSEWALL,011.44.1345.529268,2006-11-03 00:00:00,SA_REP,7000,0.25,146,80
62,162,Clara,Vishney,CVISHNEY,011.44.1346.129268,2005-11-11 00:00:00,SA_REP,10500,0.25,147,80
63,163,Danielle,Greene,DGREENE,011.44.1346.229268,2007-03-19 00:00:00,SA_REP,9500,0.15,147,80
64,164,Mattea,Marvins,MMARVINS,011.44.1346.329268,2008-01-24 00:00:00,SA_REP,7200,0.10,147,80
65,165,David,Lee,DLEE,011.44.1346.529268,2008-02-23 00:00:00,SA_REP,6800,0.10,147,80
66,166,Sundar,Ande,SANDE,011.44.1346.629268,2008-03-24 00:00:00,SA_REP,6400,0.10,147,80
67,167,Amit,Banda,ABANDA,011.44.1346.729268,2008-04-21 00:00:00,SA_REP,6200,0.10,147,80
68,168,Lisa,Ozer,LOZER,011.44.1343.929268,2005-03-11 00:00:00,SA_REP,11500,0.25,148,80
69,169,Harrison,Bloom,HBLOOM,011.44.1343.829268,2006-03-23 00:00:00,SA_REP,10000,0.20,148,80
70,170,Tayler,Fox,TFOX,011.44.1343.729268,2006-01-24 00:00:00,SA_REP,9600,0.20,148,80
71,171,William,Smith,WSMITH,011.44.1343.629268,2007-02-23 00:00:00,SA_REP,7400,0.15,148,80
72,172,Elizabeth,Bates,EBATES,011.44.1343.529268,2007-03-24 00:00:00,SA_REP,7300,0.15,148,80
73,173,Sundita,Kumar,SKUMAR,011.44.1343.329268,2008-04-21 00:00:00,SA_REP,6100,0.10,148,80
74,174,Ellen,Abel,EABEL,011.44.1644.429267,2004-05-11 00:00:00,SA_REP,11000,0.30,149,80
75,175,Alyssa,Hutton,AHUTTON,011.44.1644.429266,2005-03-19 00:00:00,SA_REP,8800,0.25,149,80
76,176,Jonathon,Taylor,JTAYLOR,011.44.1644.429265,2006-03-24 00:00:00,SA_REP,8600,0.20,149,80
77,177,Jack,Livingston,JLIVINGS,011.44.1644.429264,2006-04-23 00:00:00,SA_REP,8400,0.20,149,80
78,178,Kimberely,Grant,KGRANT,011.44.1644.429263,2007-05-24 00:00:00,SA_REP,7000,0.15,149,80
79,179,Charles,Johnson,CJOHNSON,011.44.1644.429262,2008-01-04 00:00:00,SA_REP,6200,0.10,149,80
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17 00:00:00,MK_REP,6000,0.00,201,20
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07 00:00:00,HR_REP,6500,0.00,101,40
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07 00:00:00,PR_REP,10000,0.00,101,70

In [8]:
emp_df['EMAIL'].str.lower()

0         sking
1      nkochhar
2       ldehaan
3       ahunold
4        bernst
         ...
102        pfay
103     smavris
104       hbaer
105    shiggins
106      wgietz
Name: EMAIL, Length: 107, dtype: object

In [9]:
# Convert EMAIL column to lowercase
emp_df['EMAIL'] = emp_df['EMAIL'].str.lower()
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,sking,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90
1,101,Neena,Kochhar,nkochhar,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90
2,102,Lex,De Haan,ldehaan,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90
3,103,Alexander,Hunold,ahunold,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60
4,104,Bruce,Ernst,bernst,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60

In [10]:
emp_df['JOB_ID'].str.split('_')

0         [AD, PRES]
1           [AD, VP]
2           [AD, VP]
3         [IT, PROG]
4         [IT, PROG]
           ...
102        [MK, REP]
103        [HR, REP]
104        [PR, REP]
105        [AC, MGR]
106    [AC, ACCOUNT]
Name: JOB_ID, Length: 107, dtype: object

In [13]:
# q-x
f = open('data/last_names.txt')
for line in f:
    regex = '[qx]'
    if re.search(regex, line):
        print(line, end = '')
f.close()

Cox
Alexander
Dixon
Fox
Vasquez
Rodriquez
Maxwell
Wilcox
Marquez
Vazquez
Baxter
Knox
Nixon
Sexton
Velasquez
Maddox
Hendrix
Velazquez
Felix
Nix
Mcqueen
Enriquez
Naquin
Boudreaux
Esquivel
Braxton
Paquette
Mixon
Squires
Jacques
Paxton
Levesque

In [14]:
# last-name Barn
f = open('data/last_names.txt')
for line in f:
    regex = '^Va[rs]'
    if re.search(regex, line):
        print(line, end = '')
f.close()

Vasquez
Vargas
Varner
Varela
Varney

In [15]:
# Find last_names with 5 characters, starting with M and ending with in
f = open('data/last_names.txt')
for line in f:
    regex = '^...in$'
    if re.search(regex, line):
        print(line, end = '')
f.close()

Klein
Morin
Stein
Irwin
Swain
Ervin
Erwin
Irvin
Marin
Tobin
Crain
Rubin
Spain
Levin

In [17]:
text = """Lương nhân viên theo đơn vị tiền tệ Euro là 800€, 1000€, 1500€, 1200€, 960€, 786€.
Chuyển đổi sang Dollar sẽ là 848$, 1060$, 1590$, 1272.$, 1017.6$, 833.16$"""

In [18]:
pattern = '[0-9]+\.?\d*\W'

print(re.findall(pattern, text))

['800€', '1000€', '1500€', '1200€', '960€', '786€', '848$', '1060$', '1590$', '1272.$', '1017.6$', '833.16$']

In [19]:
pattern = '\d+\.?\d+[€$]'

print(re.findall(pattern, text))

['800€', '1000€', '1500€', '1200€', '960€', '786€', '848$', '1060$', '1590$', '1017.6$', '833.16$']

In [20]:
pattern = '\d{1,}\.{0,1}\d+[€$]'

print(re.findall(pattern, text))

['800€', '1000€', '1500€', '1200€', '960€', '786€', '848$', '1060$', '1590$', '1017.6$', '833.16$']

In [21]:
# Get all salaries in Euro and Dollar (including currency symbol)
pattern = '\d+\.?\d*\W'

print(re.findall(pattern, text))

['800€', '1000€', '1500€', '1200€', '960€', '786€', '848$', '1060$', '1590$', '1272.$', '1017.6$', '833.16$']

In [ ]:
# create a pattern for the user name from 3 to 16 characters.
# It can only contain numbers and letters (no uppercase letters),
# hyphens and underscores

In [22]:
p = '^[a-z0-9_-]{3,16}$'

In [23]:
# Check if the username meets the requirements
print(bool(re.match(p, 'alice_20-03-05')))

True

In [24]:
print(bool(re.match(p, 'ali')))

True

In [25]:
print(bool(re.match(p, 'samantha@1996')))

False

In [26]:
text = "The winners are: User9, UserN, User8. The prize is $3000."
# Find all Users whose user code is a number
re.findall("User\d", text)

['User9', 'User8']

In [27]:
# Find all Users whose user ID is not a number
re.findall("User\D", text)

['UserN']

In [28]:
# Find all Users whose user code is a number or letter
re.findall("User\w", text)

['User9', 'UserN', 'User8']

In [29]:
# Find bonuses (including currency symbols)
re.findall("\W\d+", text)

['$3000']

In [30]:
text

'The winners are: User9, UserN, User8. The prize is $3000.'

In [31]:
# Split string based on punctuation and whitespace
re.split("\W\s", text)

['The winners are', 'User9', 'UserN', 'User8', 'The prize is $3000.']

In [32]:
# split
order_id = '20230209-TT*CV#0001'
re.split('\W', order_id)

['20230209', 'TT', 'CV', '0001']

In [33]:
order = pd.DataFrame(['20230209-TT*CV#0001', '20230208-DT*LT#0010'],
                     columns=['order_id'])
order

              order_id
0  20230209-TT*CV#0001
1  20230208-DT*LT#0010

In [34]:
order['order_id'].str.split('\W',expand=True)

          0   1   2     3
0  20230209  TT  CV  0001
1  20230208  DT  LT  0010

In [35]:
order[['order_date', 'category', 'product', 'item']] = order['order_id'].str.split('\W', expand=True)
order

              order_id order_date category product  item
0  20230209-TT*CV#0001   20230209       TT      CV  0001
1  20230208-DT*LT#0010   20230208       DT      LT  0010

In [36]:
order['order_id'].str.extract('(\d+)-([A-Z]+)\W(\w+)#(\d+)')

          0   1   2     3
0  20230209  TT  CV  0001
1  20230208  DT  LT  0010

In [37]:
order['order_id'].str.extract('(\w+)\W(\w+)\W(\w+)\W(\w+)')

          0   1   2     3
0  20230209  TT  CV  0001
1  20230208  DT  LT  0010

In [38]:
# other
order[['order_date', 'category', 'product', 'item']] = order['order_id'].str.extract('(\w+)\W(\w+)\W(\w+)\W(\w+)')
order

              order_id order_date category product  item
0  20230209-TT*CV#0001   20230209       TT      CV  0001
1  20230208-DT*LT#0010   20230208       DT      LT  0010

In [39]:
# replace
price = '$40,000'
price = int(re.sub('\D+', '', price))
price

40000

In [40]:
df = pd.DataFrame(['$40,000*','$40000 conditions attached'], columns=['Price'])
df

                        Price
0                    $40,000*
1  $40000 conditions attached

In [41]:
df['Price'].str.replace('\D+', '', regex=True)

0    40000
1    40000
Name: Price, dtype: object

In [42]:
df['Price'] = df['Price'].str.replace('\D+', '', regex=True).astype('int')
df

   Price
0  40000
1  40000

In [43]:
# findall
diem = 'toán: 10.0 văn: 6.25'
re.findall('(\d+\.\d+)', diem)

['10.0', '6.25']

In [44]:
diem_df = pd.DataFrame(['toán: 7.0 văn: 6.5', 'toán: 10.0 văn: 8.5', 
                  'toán: 9.5 văn: 7.0'], columns=['Điểm'])
diem_df

                  Điểm
0   toán: 7.0 văn: 6.5
1  toán: 10.0 văn: 8.5
2   toán: 9.5 văn: 7.0

In [45]:
diem_df['Điểm'].str.findall('(\d+\.\d+)').to_list()

[['7.0', '6.5'], ['10.0', '8.5'], ['9.5', '7.0']]

In [46]:
diem_df[['Toán', 'Văn']] = diem_df['Điểm'].str.findall('(\d+\.\d+)').to_list()
diem_df

                  Điểm  Toán  Văn
0   toán: 7.0 văn: 6.5   7.0  6.5
1  toán: 10.0 văn: 8.5  10.0  8.5
2   toán: 9.5 văn: 7.0   9.5  7.0

In [47]:
diem_df.dtypes

Điểm    object
Toán    object
Văn     object
dtype: object

In [48]:
diem_df[['Toán', 'Văn']] = diem_df[['Toán', 'Văn']].astype(float)

In [49]:
# cách khác
diem_df[['toan', 'van']] = diem_df['Điểm'].str.extract('toán: (\d+\.\d+) văn: (\d+\.\d+)', expand=True)
diem_df

                  Điểm  Toán  Văn  toan  van
0   toán: 7.0 văn: 6.5   7.0  6.5   7.0  6.5
1  toán: 10.0 văn: 8.5  10.0  8.5  10.0  8.5
2   toán: 9.5 văn: 7.0   9.5  7.0   9.5  7.0

In [50]:
diem_df.dtypes

Điểm     object
Toán    float64
Văn     float64
toan     object
van      object
dtype: object

In [51]:
diem_df.iloc[:,1:] = diem_df.iloc[:,1:].applymap(float)

/var/folders/p_/jr0kwjpn3qn57ngzpt6y5d6w0000gn/T/ipykernel_1415/3034421437.py:1: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  diem_df.iloc[:,1:] = diem_df.iloc[:,1:].applymap(float)

In [52]:
# search
text = "abc.pdf"
pattern = '^([a-z]+)\.pdf$'  # Một pattern đơn giản để tìm các con số.

print(re.search(pattern, text).group(1))

abc

In [53]:
data = {'Text': ['This is a sentence with 123 numbers.',
                 'Python is a powerful programming language.',
                 'Regular expressions are useful for text processing.',
                 'Data science involves 456 data analysis.']}
df = pd.DataFrame(data)

df

                                                Text
0               This is a sentence with 123 numbers.
1         Python is a powerful programming language.
2  Regular expressions are useful for text proces...
3           Data science involves 456 data analysis.

In [54]:
df['Text'].str.contains(pattern, regex=True)

/var/folders/p_/jr0kwjpn3qn57ngzpt6y5d6w0000gn/T/ipykernel_1415/2059845622.py:1: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df['Text'].str.contains(pattern, regex=True)

0    False
1    False
2    False
3    False
Name: Text, dtype: bool

In [55]:
# Sử dụng str.contains với regular expression pattern
pattern = '\d+'  # Tìm các số

matches = df[df['Text'].str.contains(pattern, regex=True)]

matches

                                       Text
0      This is a sentence with 123 numbers.
3  Data science involves 456 data analysis.

In [56]:
emp_df['PHONE_NUMBER']

0      515.123.4567
1      515.123.4568
2      515.123.4569
3      590.423.4567
4      590.423.4568
           ...
102    603.123.6666
103    515.123.7777
104    515.123.8888
105    515.123.8080
106    515.123.8181
Name: PHONE_NUMBER, Length: 107, dtype: object

In [57]:
# extract 
emp_df['PHONE_NUMBER'].str.extract('.(\d{3}).')

       0
0    123
1    123
2    123
3    423
4    423
..   ...
102  123
103  123
104  123
105  123
106  123

[107 rows x 1 columns]

In [58]:
emp_df['PHONE_NUMBER'].str.split('.').to_list()

[['515', '123', '4567'],
 ['515', '123', '4568'],
 ['515', '123', '4569'],
 ['590', '423', '4567'],
 ['590', '423', '4568'],
 ['590', '423', '4569'],
 ['590', '423', '4560'],
 ['590', '423', '5567'],
 ['515', '124', '4569'],
 ['515', '124', '4169'],
 ['515', '124', '4269'],
 ['515', '124', '4369'],
 ['515', '124', '4469'],
 ['515', '124', '4567'],
 ['515', '127', '4561'],
 ['515', '127', '4562'],
 ['515', '127', '4563'],
 ['515', '127', '4564'],
 ['515', '127', '4565'],
 ['515', '127', '4566'],
 ['650', '123', '1234'],
 ['650', '123', '2234'],
 ['650', '123', '3234'],
 ['650', '123', '4234'],
 ['650', '123', '5234'],
 ['650', '124', '1214'],
 ['650', '124', '1224'],
 ['650', '124', '1334'],
 ['650', '124', '1434'],
 ['650', '124', '5234'],
 ['650', '124', '6234'],
 ['650', '124', '7234'],
 ['650', '124', '8234'],
 ['650', '127', '1934'],
 ['650', '127', '1834'],
 ['650', '127', '1734'],
 ['650', '127', '1634'],
 ['650', '121', '1234'],
 ['650', '121', '2034'],
 ['650', '121', '2019'],
 ['650', '121', '1834'],
 ['650', '121', '8009'],
 ['650', '121', '2994'],
 ['650', '121', '2874'],
 ['650', '121', '2004'],
 ['011', '44', '1344', '429268'],
 ['011', '44', '1344', '467268'],
 ['011', '44', '1344', '429278'],
 ['011', '44', '1344', '619268'],
 ['011', '44', '1344', '429018'],
 ['011', '44', '1344', '129268'],
 ['011', '44', '1344', '345268'],
 ['011', '44', '1344', '478968'],
 ['011', '44', '1344', '498718'],
 ['011', '44', '1344', '987668'],
 ['011', '44', '1344', '486508'],
 ['011', '44', '1345', '429268'],
 ['011', '44', '1345', '929268'],
 ['011', '44', '1345', '829268'],
 ['011', '44', '1345', '729268'],
 ['011', '44', '1345', '629268'],
 ['011', '44', '1345', '529268'],
 ['011', '44', '1346', '129268'],
 ['011', '44', '1346', '229268'],
 ['011', '44', '1346', '329268'],
 ['011', '44', '1346', '529268'],
 ['011', '44', '1346', '629268'],
 ['011', '44', '1346', '729268'],
 ['011', '44', '1343', '929268'],
 ['011', '44', '1343', '829268'],
 ['011', '44', '1343', '729268'],
 ['011', '44', '1343', '629268'],
 ['011', '44', '1343', '529268'],
 ['011', '44', '1343', '329268'],
 ['011', '44', '1644', '429267'],
 ['011', '44', '1644', '429266'],
 ['011', '44', '1644', '429265'],
 ['011', '44', '1644', '429264'],
 ['011', '44', '1644', '429263'],
 ['011', '44', '1644', '429262'],
 ['650', '507', '9876'],
 ['650', '507', '9877'],
 ['650', '507', '9878'],
 ['650', '507', '9879'],
 ['650', '509', '1876'],
 ['650', '509', '2876'],
 ['650', '509', '3876'],
 ['650', '509', '4876'],
 ['650', '505', '1876'],
 ['650', '505', '2876'],
 ['650', '505', '3876'],
 ['650', '505', '4876'],
 ['650', '501', '1876'],
 ['650', '501', '2876'],
 ['650', '501', '3876'],
 ['650', '501', '4876'],
 ['650', '507', '9811'],
 ['650', '507', '9822'],
 ['650', '507', '9833'],
 ['650', '507', '9844'],
 ['515', '123', '4444'],
 ['515', '123', '5555'],
 ['603', '123', '6666'],
 ['515', '123', '7777'],
 ['515', '123', '8888'],
 ['515', '123', '8080'],
 ['515', '123', '8181']]

In [59]:
emp_df['JOB_ID']

0         AD_PRES
1           AD_VP
2           AD_VP
3         IT_PROG
4         IT_PROG
          ...
102        MK_REP
103        HR_REP
104        PR_REP
105        AC_MGR
106    AC_ACCOUNT
Name: JOB_ID, Length: 107, dtype: object

In [60]:
emp_df['JOB_ID'].str.extract('_(\w+)')

           0
0       PRES
1         VP
2         VP
3       PROG
4       PROG
..       ...
102      REP
103      REP
104      REP
105      MGR
106  ACCOUNT

[107 rows x 1 columns]

In [61]:
emp_df['Job_Code'] = emp_df['JOB_ID'].str.extract('(\w+)_')
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Job_Code
0,100,Steven,King,sking,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90,AD
1,101,Neena,Kochhar,nkochhar,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90,AD
2,102,Lex,De Haan,ldehaan,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90,AD
3,103,Alexander,Hunold,ahunold,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60,IT
4,104,Bruce,Ernst,bernst,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60,IT

In [62]:
emp_df['Job_Code1'] = emp_df['JOB_ID'].str.extract('_([A-Z]+)')
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Job_Code,Job_Code1
0,100,Steven,King,sking,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90,AD,PRES
1,101,Neena,Kochhar,nkochhar,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90,AD,VP
2,102,Lex,De Haan,ldehaan,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90,AD,VP
3,103,Alexander,Hunold,ahunold,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60,IT,PROG
4,104,Bruce,Ernst,bernst,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60,IT,PROG

In [63]:
emp_df[['HIRED_YEAR', 'HIRED_MONTH']] = emp_df['HIRE_DATE'].str.extract('(\d{4})-(\d{2})')
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,Job_Code,Job_Code1,HIRED_YEAR,HIRED_MONTH
0,100,Steven,King,sking,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90,AD,PRES,2003,06
1,101,Neena,Kochhar,nkochhar,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90,AD,VP,2005,09
2,102,Lex,De Haan,ldehaan,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90,AD,VP,2001,01
3,103,Alexander,Hunold,ahunold,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60,IT,PROG,2006,01
4,104,Bruce,Ernst,bernst,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60,IT,PROG,2007,05

In [64]:
emp_df.dtypes

EMPLOYEE_ID         int64
FIRST_NAME         object
LAST_NAME          object
EMAIL              object
PHONE_NUMBER       object
HIRE_DATE          object
JOB_ID             object
SALARY              int64
COMMISSION_PCT    float64
MANAGER_ID          int64
DEPARTMENT_ID       int64
Job_Code           object
Job_Code1          object
HIRED_YEAR         object
HIRED_MONTH        object
dtype: object

In [66]:
emp_df[['HIRED_YEAR', 'HIRED_MONTH']] = emp_df[['HIRED_YEAR', 'HIRED_MONTH']].applymap(int)